app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |file|
      new_song = Song.create(title: file[0])
      new_song.artist = Artist.find_or_create_by(name: file[1])
      new_song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 138], ["created_at", "2019-09-27 20:00:42.826006"], ["updated_at", "2019-09-27 20:00:42.826006"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-09-27 20:00:42.824274"], ["updated_at", "2019-09-27 20:00:42.824274"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 138], ["updated_at", "2019-09-27 20:04:51.709042"], ["id", 188]]